# ----------------------------------------------------------------------------#
# Embedded libraries                                                          #
# ----------------------------------------------------------------------------#
from os import path, mkdir

# ----------------------------------------------------------------------------#
# Project modules                                                             #
# ----------------------------------------------------------------------------#
from src.logs.logs import log_info
from src.utilities import creating_necessary_folders


def word_search() -> None:
    # ----------------------------------------------------------------------------------------------------------------------
    # Список всех русских букв
    # ----------------------------------------------------------------------------------------------------------------------
    list_letters = ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж',
            'э', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю']

    # ----------------------------------------------------------------------------------------------------------------------
    # Получение русских слов из словаря и сохранение в список тех, что состоят из нужного количества букв
    # ----------------------------------------------------------------------------------------------------------------------
    with open('resources/russian.txt', 'r', encoding='cp1251') as ru_words_file:
        russian_words = ru_words_file.read().lower()
    list_words = russian_words.splitlines()

    # ----------------------------------------------------------------------------------------------------------------------
    # Определение количества букв слова. Пример: 5
    # ----------------------------------------------------------------------------------------------------------------------
    log_info(message='Введите количество букв искомого слова.')
    quantity_letters_in_word = int(input())

    # ----------------------------------------------------------------------------------------------------------------------
    # Определение букв, которые есть в искомом слове. Пример: ['а', 'р', 'д']
    # ----------------------------------------------------------------------------------------------------------------------
    log_info(message='Введите подряд известные буквы искомого слова.')
    input_data = list(input().replace(' ', '').lower())
    letter_in_word = input_data

    # ----------------------------------------------------------------------------------------------------------------------
    # Определение букв, которые отсутствуют в слове и удаление их из списка букв. Пример: ['б', 'н', 'к', 'х', 'о']
    # ----------------------------------------------------------------------------------------------------------------------
    log_info(message='Введите подряд буквы, которые отсутствуют в искомом слове.')
    input_data = list(input().replace(' ', '').lower())
    list_letters_not_in_word = input_data
    list_letters = list(set(list_letters) - set(list_letters_not_in_word))
    
    # ----------------------------------------------------------------------------------------------------------------------
    # Определение позиций букв, которые есть в слове. Пример: ['+', '+', '+', 'д', 'а']
    # ----------------------------------------------------------------------------------------------------------------------
    log_info(message='Введите известные буквы по порядку так, как они находятся в искомом слове. Если буква неизвестна, замените её символом "+". Пример: "ба++я"')
    input_data = list(input().replace(' ', '').lower())
    list_found_letter = input_data

    # ----------------------------------------------------------------------------------------------------------------------
    # Определение позиций букв, на которых в слове их быть не должно. Пример: [[], [], [], [], []]
    # ----------------------------------------------------------------------------------------------------------------------
    input_data = list()
    log_info(message='Введите подряд буквы которые отсутствуют в каждой из позиций искомого слова.')
    for i in range(quantity_letters_in_word):
        log_info(message='Позиция ' + str(i+1) + ':')
        input_data.append(list(input().replace(' ', '').lower()))

    list_not_letter = input_data

    # ----------------------------------------------------------------------------------------------------------------------
    # Поиск слов
    # ----------------------------------------------------------------------------------------------------------------------
    creating_necessary_folders(path='docs')
    log_info(message='Начат перебор букв.')
    with open('docs/words.txt', 'w') as words_file:
        counter = 0
        for word in list_words:
            if len(word) == quantity_letters_in_word and all(letter in word for letter in letter_in_word) and not any(letter in word for letter in list_letters_not_in_word) and not word[0] == '-':
                for i in range(quantity_letters_in_word): 
                    if word[i] == list_found_letter[i] or (list_found_letter[i] == '+' and not any(letter in word[i] for letter in list_not_letter[i])):
                        if i == quantity_letters_in_word - 1:
                            if counter == 0:
                                words_file.write(word)                                                                                                                         # Если проверяется последняя буква слова
                            elif counter % 20 == 0:
                                words_file.write('\n' + word)
                            else:
                                words_file.write(' ' + word)
                            counter += 1
                    else:
                        break
    log_info(message='Перебор букв завершен.')
    log_info(message='Найдено слов: ' + str(counter) + '.')
